# Lab 02: SQL Queries

![Figure 1](../images/Bank%20Example%20-%20Printable.png "Bank Database")

The file bank.sql contains the SQL statements needed to create and fill the sample database illustrated in Figure 1.

In [1]:
%load_ext sql
%config SqlMagic.displaycon = 0
%config SqlMagic.displaylimit = 100
%config SqlMagic.feedback = 0
%sql postgresql+psycopg://bank:bank@postgres/bank

Write an SQL query to answer each of the questions posed below.

## 1. Filter Queries

(a) Who are the customers that live in Lisbon?

In [2]:
%%sql
SELECT DISTINCT
  customer_name
FROM
  customer
WHERE
  customer_city = 'Lisbon';

+---------------+
| customer_name |
+---------------+
|     Adams     |
|      Cook     |
|     Parker    |
+---------------+

(b) Which accounts have a balance greater than 500€?

In [14]:
%%sql
SELECT DISTINCT
    account_number
FROM
    account
WHERE
    balance > 500;

+----------------+
| account_number |
+----------------+
|     A-201      |
|     A-102      |
|     A-215      |
|     A-444      |
|     A-333      |
|     A-305      |
|     A-217      |
|     A-222      |
+----------------+

(c) What would be the new account balances at Downtown branch if it offered a 27.7% bonus on the current balance of the customers?

In [15]:
%%sql
SELECT DISTINCT
    account_number,
    balance * 1.277 AS new_balance
FROM
    account
WHERE
    branch_name = 'Downtown';

+----------------+--------------+
| account_number | new_balance  |
+----------------+--------------+
|     A-101      | 638.5000000  |
|     A-444      | 1085.4500000 |
+----------------+--------------+

## 2. Join Queries

(d) Who are the customers whose accounts have a balance greater than 500€?

In [16]:
%%sql
SELECT DISTINCT
  d.customer_name,
    a.balance
FROM
  depositor as d,
  account as a
WHERE
  d.account_number = a.account_number
  AND a.balance > 500;

+---------------+----------+
| customer_name | balance  |
+---------------+----------+
|    Johnson    | 900.0000 |
|     Brown     | 600.0000 |
|    Iacocca    | 650.0000 |
|     Flores    | 800.0000 |
|      Cook     | 700.0000 |
|     Brown     | 850.0000 |
|     Oliver    | 750.0000 |
|     Evans     | 550.0000 |
+---------------+----------+

(e) In which cities do the customers with loans between 1000€ and 2000€ live?

In [31]:
%%sql
SELECT DISTINCT
    customer_city
FROM
    customer as c 
        JOIN borrower as b USING (customer_name)
        JOIN loan as l USING(loan_number) 
WHERE
    amount BETWEEN 1000 AND 2000;

+---------------+
| customer_city |
+---------------+
|    Coimbra    |
|      Faro     |
|     Oporto    |
+---------------+

(f) What is the balance of all the accounts of the customer that has loan L-15?

In [36]:
%%sql
SELECT DISTINCT
    balance
FROM
    customer as c
        JOIN borrower as b USING (customer_name)
        JOIN depositor as d USING (customer_name)
        JOIN account as a USING (account_number)
WHERE
    loan_number = 'L-15';

+----------+
| balance  |
+----------+
| 500.0000 |
| 700.0000 |
+----------+

(g) On which branches do customers whose names begin with 'J' and end in 'n' have their accounts?

In [37]:
%%sql
SELECT DISTINCT
    branch_name
FROM
    customer as c
        JOIN depositor as d USING (customer_name)
        JOIN account as a USING (account_number)
WHERE
    customer_name LIKE 'J%n'

+-------------+
| branch_name |
+-------------+
|   Downtown  |
|    Uptown   |
+-------------+

(h) What are the loan amounts of the customers who live cities whose names are exactly 6 characters long? (only using the __LIKE__ operator)

(i) What are the loan amounts of all clients living in a city whose name has at least one space in the middle (not at the beginning nor at the end)? (using __LIKE__ and __NOT LIKE__)

(j) What are the assets of the agencies where ‘Johnson’ has an account?

(k) Who are the customers that have a loan from an agency in the same city where they live?

(l) Who are the customers that live in cities that have bank branches? (using __DISTINCT__)

(m) Who are the customers that have an account and a loan (using __INTERSECT__ operator)

## 3. Advanced Queries

(n) Who are the customers who live in cities where there are no bank branches? (Tip: use __NOT IN__)

(o) What is the total amount of account balances in branches in the city of Lisbon (‘Lisbon’)? (Tip: use __SUM__)